In [1]:
import pandas as pd

In [3]:
items = {
    'Bob': pd.Series([245, 25, 55], index=['bike', 'pants', 'watch']),
    'Alice': pd.Series([40, 110, 500, 45], index=['book', 'glasses', 'bike', 'pants'])
        }
type(items)

dict

In [4]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [6]:
data = {'Bob': pd.Series([245, 25, 55]),
         'Alice': pd.Series([40, 110, 500, 45])}
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [7]:
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [8]:
sel_shopping_cart = pd.DataFrame(items, index=['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [11]:
alice_sel_shopping_cart = pd.DataFrame(items, columns = ['Alice'], index=['glasses', 'bike', 'watch'])
alice_sel_shopping_cart

         Alice
glasses  110.0
bike     500.0
watch      NaN

In [14]:
data = {'Integers': [1,2,3],
       'Floats': [4.5, 8.6, 1.4]}
df = pd.DataFrame(data)
df

   Integers  Floats
0         1     4.5
1         2     8.6
2         3     1.4

In [15]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35}, {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]
store_items = pd.DataFrame(items, index=['store1', 'store2'])
store_items

        bikes  pants  watches  glasses
store1     20     30       35      NaN
store2     15      5       10     50.0